In [4]:
import numpy as np
import pandas as pd

In [7]:
df = pd.read_csv("employees.csv")
df.head()
# df.tail() (son 5 satır)

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male   8/6/1993  ...   6.945               True        Marketing
1     Thomas    Male  3/31/1996  ...   4.170               True              NaN
2      Maria  Female  4/23/1993  ...  11.858              False          Finance
3      Jerry    Male   3/4/2005  ...   9.340               True          Finance
4      Larry    Male  1/24/1998  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [17]:
# Bunun içinde null veri var mı ve bunun sayısı ne?
df['Team'].isnull().sum()

43

In [18]:
# Eksik veri sayısı.
df.isnull().sum()

First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
dtype: int64

    df.dropna(how=any) 
(any --> bir veri bile eksik olsa tüm satırı siler.)
(all --> tüm satır  eksik iste tamamını siler.)

    df.dropna(thresh=2) 
(thresh --> en az 2 verisi dolu olan sütunları tut gibi.)

    df.dropna(thresh=2).isnull().sum() 

    len(df.columns) 
(sütun sayısı)

    df.shape
(satır sayısı,sütun sayısı)

In [29]:
df2 = pd.DataFrame(np.random.rand(3,2),
                   columns=['sutun 1', 'surun 2'],
                   index=['a','b','c'])

In [30]:
df2

    sutun 1   surun 2
a  0.015336  0.324701
b  0.358243  0.372741
c  0.729517  0.834143

In [33]:
# Veri setini numpy array'e dönüştürür.
# pandas ---> numpy
df2.to_numpy()

array([[0.01533611, 0.32470122],
       [0.35824269, 0.37274097],
       [0.72951677, 0.83414258]])

In [34]:
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male   8/6/1993  ...   6.945               True        Marketing
1     Thomas    Male  3/31/1996  ...   4.170               True              NaN
2      Maria  Female  4/23/1993  ...  11.858              False          Finance
3      Jerry    Male   3/4/2005  ...   9.340               True          Finance
4      Larry    Male  1/24/1998  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [35]:
df.Team.value_counts()

Team
Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: count, dtype: int64

In [41]:
# büyükten --> küçüğe
df.sort_values(by='Salary' ,ascending=False)

# küçükten --> büyüğe
# df.sort_values(by='Salary')

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
644  Katherine  Female  8/13/1996  ...  18.912              False          Finance
429       Rose  Female  5/28/2015  ...   5.630              False  Human Resources
828    Cynthia  Female  7/12/2006  ...   7.864              False          Product
186        NaN  Female  2/23/2005  ...   1.825                NaN            Sales
160      Kathy  Female  3/18/2000  ...  16.991               True          Finance
..         ...     ...        ...  ...     ...                ...              ...
650    Cynthia  Female   7/5/1986  ...  11.749              False          Finance
63     Matthew    Male   1/2/2013  ...  18.040              False  Human Resources
82      Steven    Male  3/30/1980  ...   8.379               True  Client Services
238      Kevin    Male  3/25/1982  ...   5.128              False            Legal
576    Michael    Male  7/30/1993  ...  14.879              False          Product

[1000 rows x 8 columns]

In [43]:
# Veri tipleri
df.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

In [45]:
df.sort_values(by='Salary' ,ascending=False, inplace=True)

In [51]:
# indexleri reset eder ve sıfırdan başlatır.
df.reset_index(drop=True, inplace=True)

In [50]:
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0  Katherine  Female  8/13/1996  ...  18.912              False          Finance
1       Rose  Female  5/28/2015  ...   5.630              False  Human Resources
2    Cynthia  Female  7/12/2006  ...   7.864              False          Product
3        NaN  Female  2/23/2005  ...   1.825                NaN            Sales
4      Kathy  Female  3/18/2000  ...  16.991               True          Finance

[5 rows x 8 columns]

Yukarıdaki tabloyu kaydetmek için

In [55]:
df.to_csv("siralanmis.csv")

# Eğer bir dosya içine kaydetmek istenirse
# df.to_csv("data \\ siralanmis.csv")

## APPLY

In [57]:
# Mesela herkese 1000 TL zam yap gibi.
df['zamli_maas']= df.Salary.apply(lambda x: x+1000)

In [64]:
df['baslangic_ayi'] = df['Start Date'].apply(lambda x: x.split('/')[0])

In [63]:
df.head()

  First Name  Gender Start Date  ...             Team  zamli_maas  baslangic_ayi
0  Katherine  Female  8/13/1996  ...          Finance      151908              8
1       Rose  Female  5/28/2015  ...  Human Resources      151903              5
2    Cynthia  Female  7/12/2006  ...          Product      151684              7
3        NaN  Female  2/23/2005  ...            Sales      151654              2
4      Kathy  Female  3/18/2000  ...          Finance      151563              3

[5 rows x 10 columns]

    regex komutları

In [65]:
df['tam_sayi_bonuslar'] = df['Bonus %'].apply(lambda x: int(x))